benchmarks/logs/2026-04-30_head_quiet/burst_get_bookmarks.txt
Running 30s test @ http://localhost:8080/bookmarks
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.96ms    1.05ms   7.27ms   72.65%
    Req/Sec     2.61k   305.58     4.82k    74.54%
  Latency Distribution
     50%    2.07ms
     75%    2.34ms
     90%    2.94ms
     99%    4.80ms
  156453 requests in 30.10s, 1.65GB read
Requests/sec:   5196.93
Transfer/sec:     56.15MB