benchmarks/logs/2026-04-30_head_quiet/soak_get_bookmarks.txt
Running 5m test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   770.68us  410.31us   5.55ms   62.50%
    Req/Sec     5.24k    63.49     5.34k    71.54%
  Latency Distribution
     50%  756.00us
     75%    1.10ms
     90%    1.35ms
     99%    1.73ms
  1563359 requests in 5.00m, 16.50GB read
Requests/sec:   5209.47
Transfer/sec:     56.29MB